USE homework3;

INSERT INTO goods_сategory (goods_сategory_name) VALUES 
('обувь'),('брюки'),('рубашки'),('пиджаки'),('аксессуары'),('портфели'),('часы');

INSERT INTO goods (goods_name, price, goods_category_id) VALUES ('туфли','100','1'),('ботинки','200','1'),('лоферы','150','1'),
('чинос','50','2'),('брюки','150','2'),('джинсы','100','2'),
('короткий рукав','70','3'),('поло','50','3'),('длинный рукав','100','3'),
('однобортный','200','4'),('двубортный','200','4'),('блейзер','200','4'),
('запонки','250','5'),('ремень','200','5'),('галстук','70','5'),
('сумка','150','6'),('портфель','200','6'),('кейс','1200','6'),
('луч','100','7'),('тиссот','1050','7'),('ролекс','10000','7');

INSERT INTO customer (customer_name) VALUES ('Иванов'),('Петров'),('Сидоров'),('Гренкин'),('Блинов'), ('Грелкин');

INSERT INTO customer_order (quantity, customer_id, goods_id) VALUES 
(1,1,1),(3,1,8),(1,1,2),(4,1,3),(3,1,4),(5,1,5),
(1,2,8),
(1,3,13),(1,3,10),(1,3,6),(1,3,7),
(1,4,19),
(1,5,21),(1,5,18),(3,5,12),(1,5,9),(1,5,8),(3,5,5),(1,5,5),(1,5,14),(3,5,15);
